irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_can_1027_IUT.c
  CS_CMM_PROBE_NODE_STMT(23,7,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(23,6,1) if (CANx == ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable127,103) 

    
    CS_CMM_PROBE_NODE_STMT(23,5,2) RCC_APB1PeriphResetCmd(((uint32_t)0x02000000), ENABLE);

    RCC_APB1PeriphResetCmd(((uint32_t)0x02000000), DISABLE);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable128,104) 

    
    CS_CMM_PROBE_NODE_STMT(23,4,3) RCC_APB1PeriphResetCmd(((uint32_t)0x04000000), ENABLE);

    RCC_APB1PeriphResetCmd(((uint32_t)0x04000000), DISABLE);
  }

CS_CMM_PROBE_NODE_STMT(23,3,4) 
 CODESCROLL_FUNC_END(53, 4, 162) } CODESCROLL_FUNC_END_RBRACE 
/* # 173 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_can.c"*/
uint8_t CAN_Init(CAN_TypeDef* CANx, CAN_InitTypeDef* CAN_InitStruct)
{ CODESCROLL_FUNC_BEGIN(54, (54, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable129,105) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable130,23,2,0)

  uint8_t InitStatus = ((uint8_t)0x00);
  uint32_t wait_ack = 0x00000000;

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);


  CANx->MCR &= ~((uint32_t)0x00000002);


  CANx->MCR |= ((uint32_t)0x00000001) ;


  while ( CS_CMM_PROBE_NODE_EXPR(23,1,1) CS_MCDC_54_0(((CANx->MSR & ((uint32_t)0x00000001)) != ((uint32_t)0x00000001)), (wait_ack != ((uint32_t)0x0000FFFF)), 3))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable131,2) 
    
    CS_CMM_PROBE_NODE_STMT(23,0,2) wait_ack++;
  } CS_CMM_PROBE_CX(3) CS_CMM_LABEL(cs_cmm_while_end_54_1) 


  
  CS_CMM_PROBE_NODE_STMT(24,7,3) if ((CANx->MSR & ((uint32_t)0x00000001)) != ((uint32_t)0x00000001))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable132,106) 
    
    CS_CMM_PROBE_NODE_STMT(24,6,4) InitStatus = ((uint8_t)0x00);
  }
  else
  {

    
    CS_CMM_PROBE_NODE_STMT(24,5,5) if (CAN_InitStruct->CAN_TTCM == ENABLE)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable133,107) 
      
      CS_CMM_PROBE_NODE_STMT(24,4,6) CANx->MCR |= ((uint32_t)0x00000080);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable134,108) 
      
      CS_CMM_PROBE_NODE_STMT(24,3,7) CANx->MCR &= ~((uint32_t)0x00000080);
    }


    
    CS_CMM_PROBE_NODE_STMT(24,2,8) if (CAN_InitStruct->CAN_ABOM == ENABLE)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable135,109) 
      
      CS_CMM_PROBE_NODE_STMT(24,1,9) CANx->MCR |= ((uint32_t)0x00000040);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable136,110) 
      
      CS_CMM_PROBE_NODE_STMT(24,0,10) CANx->MCR &= ~((uint32_t)0x00000040);
    }


    
    CS_CMM_PROBE_NODE_STMT(25,7,11) if (CAN_InitStruct->CAN_AWUM == ENABLE)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable137,111) 
      
      CS_CMM_PROBE_NODE_STMT(25,6,12) CANx->MCR |= ((uint32_t)0x00000020);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable138,112) 
      
      CS_CMM_PROBE_NODE_STMT(25,5,13) CANx->MCR &= ~((uint32_t)0x00000020);
    }


    
    CS_CMM_PROBE_NODE_STMT(25,4,14) if (CAN_InitStruct->CAN_NART == ENABLE)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable139,113) 
      
      CS_CMM_PROBE_NODE_STMT(25,3,15) CANx->MCR |= ((uint32_t)0x00000010);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable140,114) 
      
      CS_CMM_PROBE_NODE_STMT(25,2,16) CANx->MCR &= ~((uint32_t)0x00000010);
    }


    
    CS_CMM_PROBE_NODE_STMT(25,1,17) if (CAN_InitStruct->CAN_RFLM == ENABLE)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable141,115) 
      
      CS_CMM_PROBE_NODE_STMT(25,0,18) CANx->MCR |= ((uint32_t)0x00000008);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable142,116) 
      
      CS_CMM_PROBE_NODE_STMT(26,7,19) CANx->MCR &= ~((uint32_t)0x00000008);
    }


    
    CS_CMM_PROBE_NODE_STMT(26,6,20) if (CAN_InitStruct->CAN_TXFP == ENABLE)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable143,117) 
      
      CS_CMM_PROBE_NODE_STMT(26,5,21) CANx->MCR |= ((uint32_t)0x00000004);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable144,118) 
      
      CS_CMM_PROBE_NODE_STMT(26,4,22) CANx->MCR &= ~((uint32_t)0x00000004);
    }


    
    CS_CMM_PROBE_NODE_STMT(26,3,23) CANx->BTR = (uint32_t)((uint32_t)CAN_InitStruct->CAN_Mode << 30) | ((uint32_t)CAN_InitStruct->CAN_SJW << 24) |
               ((uint32_t)CAN_InitStruct->CAN_BS1 << 16) | ((uint32_t)CAN_InitStruct->CAN_BS2 << 20) |
               ((uint32_t)CAN_InitStruct->CAN_Prescaler - 1);


    CANx->MCR &= ~((uint32_t)0x00000001);


   wait_ack = 0x00;

   while ( CS_CMM_PROBE_NODE_EXPR(26,2,24) CS_MCDC_54_8(((CANx->MSR & ((uint32_t)0x00000001)) == ((uint32_t)0x00000001)), (wait_ack != ((uint32_t)0x0000FFFF)), 6))
   { CS_CMM_PROBE_DECL_CX(CodeScrollVariable145,4) 
     
     CS_CMM_PROBE_NODE_STMT(26,1,25) wait_ack++;
   } CS_CMM_PROBE_CX(5) CS_CMM_LABEL(cs_cmm_while_end_54_24) 


    
    CS_CMM_PROBE_NODE_STMT(26,0,26) if ((CANx->MSR & ((uint32_t)0x00000001)) == ((uint32_t)0x00000001))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable146,119) 
      
      CS_CMM_PROBE_NODE_STMT(27,7,27) InitStatus = ((uint8_t)0x00);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable147,120) 
      
      CS_CMM_PROBE_NODE_STMT(27,6,28) InitStatus = ((uint8_t)0x01) ;
    }
  }


  
  CS_CMM_PROBE_NODE_STMT(27,5,29) 
   CODESCROLL_FUNC_END(54, 4, 298) return InitStatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 308 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_can.c"*/
void CAN_FilterInit(CAN_FilterInitTypeDef* CAN_FilterInitStruct)
{ CODESCROLL_FUNC_BEGIN(55, (55, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable148,121) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable149,27,4,0)

