irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_can_1027_IUT.c
  uint32_t filter_number_bit_pos = 0;

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  filter_number_bit_pos = ((uint32_t)0x00000001) << CAN_FilterInitStruct->CAN_FilterNumber;


  ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FMR |= ((uint32_t)0x00000001);


  ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FA1R &= ~(uint32_t)filter_number_bit_pos;


  
  CS_CMM_PROBE_NODE_STMT(27,3,1) if (CAN_FilterInitStruct->CAN_FilterScale == ((uint8_t)0x00))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable150,122) 

    
    CS_CMM_PROBE_NODE_STMT(27,2,2) ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FS1R &= ~(uint32_t)filter_number_bit_pos;



    ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR1 =
    ((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdLow) << 16) |
        (0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdLow);



    ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR2 =
    ((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdHigh) << 16) |
        (0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdHigh);
  } CS_CMM_ELSE_PROBE_C1(123) 

  
  CS_CMM_PROBE_NODE_STMT(27,1,3) if (CAN_FilterInitStruct->CAN_FilterScale == ((uint8_t)0x01))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable151,124) 

    
    CS_CMM_PROBE_NODE_STMT(27,0,4) ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FS1R |= filter_number_bit_pos;

    ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR1 =
    ((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdHigh) << 16) |
        (0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdLow);

    ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR2 =
    ((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdHigh) << 16) |
        (0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdLow);
  } CS_CMM_ELSE_PROBE_C1(125) 


  
  CS_CMM_PROBE_NODE_STMT(28,7,5) if (CAN_FilterInitStruct->CAN_FilterMode == ((uint8_t)0x00))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable152,126) 

    
    CS_CMM_PROBE_NODE_STMT(28,6,6) ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FM1R &= ~(uint32_t)filter_number_bit_pos;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable153,127) 

    
    CS_CMM_PROBE_NODE_STMT(28,5,7) ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FM1R |= (uint32_t)filter_number_bit_pos;
  }


  
  CS_CMM_PROBE_NODE_STMT(28,4,8) if (CAN_FilterInitStruct->CAN_FilterFIFOAssignment == ((uint8_t)0x00))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable154,128) 

    
    CS_CMM_PROBE_NODE_STMT(28,3,9) ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FFA1R &= ~(uint32_t)filter_number_bit_pos;
  } CS_CMM_ELSE_PROBE_C1(129) 

  
  CS_CMM_PROBE_NODE_STMT(28,2,10) if (CAN_FilterInitStruct->CAN_FilterFIFOAssignment == ((uint8_t)0x01))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable155,130) 

    
    CS_CMM_PROBE_NODE_STMT(28,1,11) ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FFA1R |= (uint32_t)filter_number_bit_pos;
  } CS_CMM_ELSE_PROBE_C1(131) 


  
  CS_CMM_PROBE_NODE_STMT(28,0,12) if (CAN_FilterInitStruct->CAN_FilterActivation == ENABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable156,132) 
    
    CS_CMM_PROBE_NODE_STMT(29,7,13) ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FA1R |= filter_number_bit_pos;
  } CS_CMM_ELSE_PROBE_C1(133) 


  
  CS_CMM_PROBE_NODE_STMT(29,6,14) ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FMR &= ~((uint32_t)0x00000001);

CS_CMM_PROBE_NODE_STMT(29,5,15) 
 CODESCROLL_FUNC_END(55, 4, 392) } CODESCROLL_FUNC_END_RBRACE 







void CAN_StructInit(CAN_InitTypeDef* CAN_InitStruct)
{ CODESCROLL_FUNC_BEGIN(56, (56, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable157,134) 


  
  CS_CMM_PROBE_NODE_STMT(29,4,0) CAN_InitStruct->CAN_TTCM = DISABLE;

  CAN_InitStruct->CAN_ABOM = DISABLE;

  CAN_InitStruct->CAN_AWUM = DISABLE;

  CAN_InitStruct->CAN_NART = DISABLE;

  CAN_InitStruct->CAN_RFLM = DISABLE;

  CAN_InitStruct->CAN_TXFP = DISABLE;

  CAN_InitStruct->CAN_Mode = ((uint8_t)0x00);

  CAN_InitStruct->CAN_SJW = ((uint8_t)0x00);

  CAN_InitStruct->CAN_BS1 = ((uint8_t)0x03);

  CAN_InitStruct->CAN_BS2 = ((uint8_t)0x02);

  CAN_InitStruct->CAN_Prescaler = 1;

CS_CMM_PROBE_NODE_STMT(29,3,1) 
 CODESCROLL_FUNC_END(56, 4, 425) } CODESCROLL_FUNC_END_RBRACE 







void CAN_SlaveStartBank(uint8_t CAN_BankNumber)
{ CODESCROLL_FUNC_BEGIN(57, (57, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable158,135) 

  
  CS_CMM_PROBE_NODE_STMT(29,2,0) ((void)0);

  ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FMR |= ((uint32_t)0x00000001);

  ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FMR &= (uint32_t)0xFFFFC0F1 ;
  ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FMR |= (uint32_t)(CAN_BankNumber)<<8;

  ((CAN_TypeDef *) (((uint32_t)0x40000000) + 0x6400))->FMR &= ~((uint32_t)0x00000001);

CS_CMM_PROBE_NODE_STMT(29,1,1) 
 CODESCROLL_FUNC_END(57, 4, 444) } CODESCROLL_FUNC_END_RBRACE 
/* # 459 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_can.c"*/
void CAN_ITConfig(CAN_TypeDef* CANx, uint32_t CAN_IT, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(58, (58, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable159,136) 

  
  CS_CMM_PROBE_NODE_STMT(29,0,0) ((void)0);
  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(30,7,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable160,137) 

    
    CS_CMM_PROBE_NODE_STMT(30,6,2) CANx->IER |= CAN_IT;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable161,138) 

    
    CS_CMM_PROBE_NODE_STMT(30,5,3) CANx->IER &= ~CAN_IT;
  }

CS_CMM_PROBE_NODE_STMT(30,4,4) 
 CODESCROLL_FUNC_END(58, 4, 476) } CODESCROLL_FUNC_END_RBRACE 
/* # 486 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_can.c"*/
uint8_t CAN_Transmit(CAN_TypeDef* CANx, CanTxMsg* TxMessage)
{ CODESCROLL_FUNC_BEGIN(59, (59, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable162,139) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable163,30,3,0)

