irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_can_1027_IUT.c
  uint8_t transmit_mailbox = 0;

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);


  
  CS_CMM_PROBE_NODE_STMT(30,2,1) if ((CANx->TSR&((uint32_t)0x04000000)) == ((uint32_t)0x04000000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable164,140) 
    
    CS_CMM_PROBE_NODE_STMT(30,1,2) transmit_mailbox = 0;
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(30,0,3) if ((CANx->TSR&((uint32_t)0x08000000)) == ((uint32_t)0x08000000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable165,141) 
    
    CS_CMM_PROBE_NODE_STMT(31,7,4) transmit_mailbox = 1;
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(31,6,5) if ((CANx->TSR&((uint32_t)0x10000000)) == ((uint32_t)0x10000000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable166,142) 
    
    CS_CMM_PROBE_NODE_STMT(31,5,6) transmit_mailbox = 2;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable167,143) 
    
    CS_CMM_PROBE_NODE_STMT(31,4,7) transmit_mailbox = ((uint8_t)0x04);
  }
  }
  }

  
  CS_CMM_PROBE_NODE_STMT(31,3,8) if (transmit_mailbox != ((uint8_t)0x04))
  {

    
    CS_CMM_PROBE_NODE_STMT(31,2,9) CANx->sTxMailBox[transmit_mailbox].TIR &= ((uint32_t)0x00000001);
    
    CS_CMM_PROBE_NODE_STMT(31,1,10) if (TxMessage->IDE == ((uint32_t)0x00000000))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable168,144) 
      
      CS_CMM_PROBE_NODE_STMT(31,0,11) ((void)0);
      CANx->sTxMailBox[transmit_mailbox].TIR |= ((TxMessage->StdId << 21) | TxMessage->RTR);
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable169,145) 
      
      CS_CMM_PROBE_NODE_STMT(32,7,12) ((void)0);
      CANx->sTxMailBox[transmit_mailbox].TIR |= ((TxMessage->ExtId<<3) | TxMessage->IDE |
                                               TxMessage->RTR);
    }



    
    CS_CMM_PROBE_NODE_STMT(32,6,13) TxMessage->DLC &= (uint8_t)0x0000000F;
    CANx->sTxMailBox[transmit_mailbox].TDTR &= (uint32_t)0xFFFFFFF0;
    CANx->sTxMailBox[transmit_mailbox].TDTR |= TxMessage->DLC;


    CANx->sTxMailBox[transmit_mailbox].TDLR = (((uint32_t)TxMessage->Data[3] << 24) |
                                             ((uint32_t)TxMessage->Data[2] << 16) |
                                             ((uint32_t)TxMessage->Data[1] << 8) |
                                             ((uint32_t)TxMessage->Data[0]));
    CANx->sTxMailBox[transmit_mailbox].TDHR = (((uint32_t)TxMessage->Data[7] << 24) |
                                             ((uint32_t)TxMessage->Data[6] << 16) |
                                             ((uint32_t)TxMessage->Data[5] << 8) |
                                             ((uint32_t)TxMessage->Data[4]));

    CANx->sTxMailBox[transmit_mailbox].TIR |= ((uint32_t)0x00000001);
  } CS_CMM_ELSE_PROBE_C1(146) 
  
  CS_CMM_PROBE_NODE_STMT(32,5,14) 
   CODESCROLL_FUNC_END(59, 4, 547) return transmit_mailbox;
} CODESCROLL_FUNC_END_RBRACE 







uint8_t CAN_TransmitStatus(CAN_TypeDef* CANx, uint8_t TransmitMailbox)
{ CODESCROLL_FUNC_BEGIN(60, (60, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable170,147) 

  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable171,32,4,0)

  uint8_t state = 0;

  ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(32,3,1) switch (TransmitMailbox)
  {
    case (0): CS_CMM_PROBE_C1(148)  
    CS_CMM_PROBE_NODE_STMT(32,2,2) state |= (uint8_t)((CANx->TSR & ((uint32_t)0x00000001)) << 2);
      state |= (uint8_t)((CANx->TSR & ((uint32_t)0x00000002)) >> 0);
      state |= (uint8_t)((CANx->TSR & ((uint32_t)0x04000000)) >> 26);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_60_1) ;
    case (1): CS_CMM_PROBE_C1(149)  
    CS_CMM_PROBE_NODE_STMT(32,1,3) state |= (uint8_t)((CANx->TSR & ((uint32_t)0x00000100)) >> 6);
      state |= (uint8_t)((CANx->TSR & ((uint32_t)0x00000200)) >> 8);
      state |= (uint8_t)((CANx->TSR & ((uint32_t)0x08000000)) >> 27);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_60_1) ;
    case (2): CS_CMM_PROBE_C1(150)  
    CS_CMM_PROBE_NODE_STMT(32,0,4) state |= (uint8_t)((CANx->TSR & ((uint32_t)0x00010000)) >> 14);
      state |= (uint8_t)((CANx->TSR & ((uint32_t)0x00020000)) >> 16);
      state |= (uint8_t)((CANx->TSR & ((uint32_t)0x10000000)) >> 28);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_60_1) ;
    default: CS_CMM_PROBE_C1(151) 
      
      CS_CMM_PROBE_NODE_STMT(33,7,5) state = ((uint8_t)0x00);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_60_1) ;
  } CS_CMM_LABEL(cs_cmm_switch_end_60_1) 
  
  CS_CMM_PROBE_NODE_STMT(33,6,6) switch (state)
  {

    case (0x0): CS_CMM_PROBE_C1(152)  
    CS_CMM_PROBE_NODE_STMT(33,5,7) state = ((uint8_t)0x02);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_60_6) ;

    case (0x5): CS_CMM_PROBE_C1(153)  
    CS_CMM_PROBE_NODE_STMT(33,4,8) state = ((uint8_t)0x00);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_60_6) ;

    case (0x7): CS_CMM_PROBE_C1(154)  
    CS_CMM_PROBE_NODE_STMT(33,3,9) state = ((uint8_t)0x01);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_60_6) ;
    default: CS_CMM_PROBE_C1(155) 
      
      CS_CMM_PROBE_NODE_STMT(33,2,10) state = ((uint8_t)0x00);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_60_6) ;
  } CS_CMM_LABEL(cs_cmm_switch_end_60_6) 
  
  CS_CMM_PROBE_NODE_STMT(33,1,11) 
   CODESCROLL_FUNC_END(60, 4, 596) return state;
} CODESCROLL_FUNC_END_RBRACE 







void CAN_CancelTransmit(CAN_TypeDef* CANx, uint8_t Mailbox)
{ CODESCROLL_FUNC_BEGIN(61, (61, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable172,156) 

  
  CS_CMM_PROBE_NODE_STMT(33,0,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(34,7,1) switch (Mailbox)
  {
    case (0): CS_CMM_PROBE_C1(157)  
    CS_CMM_PROBE_NODE_STMT(34,6,2) CANx->TSR |= ((uint32_t)0x00000080);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_61_1) ;
    case (1): CS_CMM_PROBE_C1(158)  
    CS_CMM_PROBE_NODE_STMT(34,5,3) CANx->TSR |= ((uint32_t)0x00008000);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_61_1) ;
    case (2): CS_CMM_PROBE_C1(159)  
    CS_CMM_PROBE_NODE_STMT(34,4,4) CANx->TSR |= ((uint32_t)0x00800000);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_61_1) ;
    default: CS_CMM_PROBE_C1(160) 
      
      CS_CMM_PROBE_NODE_STMT(34,3,5) CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_61_1) ;
  } CS_CMM_LABEL(cs_cmm_switch_end_61_1) 

CS_CMM_PROBE_NODE_STMT(34,2,6) 
 CODESCROLL_FUNC_END(61, 4, 622) } CODESCROLL_FUNC_END_RBRACE 







void CAN_FIFORelease(CAN_TypeDef* CANx, uint8_t FIFONumber)
{ CODESCROLL_FUNC_BEGIN(62, (62, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable173,161) 

  
