irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_can_1027_IUT.c
  CS_CMM_PROBE_NODE_STMT(34,1,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(34,0,1) if (FIFONumber == ((uint8_t)0x00))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable174,162) 
    
    CS_CMM_PROBE_NODE_STMT(35,7,2) CANx->RF0R = ((uint32_t)0x00000020);
  }

  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable175,163) 
    
    CS_CMM_PROBE_NODE_STMT(35,6,3) CANx->RF1R = ((uint32_t)0x00000020);
  }

CS_CMM_PROBE_NODE_STMT(35,5,4) 
 CODESCROLL_FUNC_END(62, 4, 645) } CODESCROLL_FUNC_END_RBRACE 







uint8_t CAN_MessagePending(CAN_TypeDef* CANx, uint8_t FIFONumber)
{ CODESCROLL_FUNC_BEGIN(63, (63, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable176,164) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable177,35,4,0)

  uint8_t message_pending=0;

  ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(35,3,1) if (FIFONumber == ((uint8_t)0x00))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable178,165) 
    
    CS_CMM_PROBE_NODE_STMT(35,2,2) message_pending = (uint8_t)(CANx->RF0R&(uint32_t)0x03);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(35,1,3) if (FIFONumber == ((uint8_t)0x01))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable179,166) 
    
    CS_CMM_PROBE_NODE_STMT(35,0,4) message_pending = (uint8_t)(CANx->RF1R&(uint32_t)0x03);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable180,167) 
    
    CS_CMM_PROBE_NODE_STMT(36,7,5) message_pending = 0;
  }
  }
  
  CS_CMM_PROBE_NODE_STMT(36,6,6) 
   CODESCROLL_FUNC_END(63, 4, 671) return message_pending;
} CODESCROLL_FUNC_END_RBRACE 
/* # 682 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_can.c"*/
void CAN_Receive(CAN_TypeDef* CANx, uint8_t FIFONumber, CanRxMsg* RxMessage)
{ CODESCROLL_FUNC_BEGIN(64, (64, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable181,168) 

  
  CS_CMM_PROBE_NODE_STMT(36,5,0) ((void)0);
  ((void)0);

  RxMessage->IDE = (uint8_t)0x04 & CANx->sFIFOMailBox[FIFONumber].RIR;
  
  CS_CMM_PROBE_NODE_STMT(36,4,1) if (RxMessage->IDE == ((uint32_t)0x00000000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable182,169) 
    
    CS_CMM_PROBE_NODE_STMT(36,3,2) RxMessage->StdId = (uint32_t)0x000007FF & (CANx->sFIFOMailBox[FIFONumber].RIR >> 21);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable183,170) 
    
    CS_CMM_PROBE_NODE_STMT(36,2,3) RxMessage->ExtId = (uint32_t)0x1FFFFFFF & (CANx->sFIFOMailBox[FIFONumber].RIR >> 3);
  }

  
  CS_CMM_PROBE_NODE_STMT(36,1,4) RxMessage->RTR = (uint8_t)0x02 & CANx->sFIFOMailBox[FIFONumber].RIR;

  RxMessage->DLC = (uint8_t)0x0F & CANx->sFIFOMailBox[FIFONumber].RDTR;

  RxMessage->FMI = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RDTR >> 8);

  RxMessage->Data[0] = (uint8_t)0xFF & CANx->sFIFOMailBox[FIFONumber].RDLR;
  RxMessage->Data[1] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RDLR >> 8);
  RxMessage->Data[2] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RDLR >> 16);
  RxMessage->Data[3] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RDLR >> 24);
  RxMessage->Data[4] = (uint8_t)0xFF & CANx->sFIFOMailBox[FIFONumber].RDHR;
  RxMessage->Data[5] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RDHR >> 8);
  RxMessage->Data[6] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RDHR >> 16);
  RxMessage->Data[7] = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RDHR >> 24);

  CAN_FIFORelease(CANx, FIFONumber);

CS_CMM_PROBE_NODE_STMT(36,0,5) 
 CODESCROLL_FUNC_END(64, 4, 714) } CODESCROLL_FUNC_END_RBRACE 
/* # 723 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_can.c"*/
void CAN_DBGFreeze(CAN_TypeDef* CANx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(65, (65, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable184,171) 

  
  CS_CMM_PROBE_NODE_STMT(37,7,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(37,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable185,172) 

    
    CS_CMM_PROBE_NODE_STMT(37,5,2) CANx->MCR |= ((uint32_t)0x00010000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable186,173) 

    
    CS_CMM_PROBE_NODE_STMT(37,4,3) CANx->MCR &= ~((uint32_t)0x00010000);
  }

CS_CMM_PROBE_NODE_STMT(37,3,4) 
 CODESCROLL_FUNC_END(65, 4, 739) } CODESCROLL_FUNC_END_RBRACE 






uint8_t CAN_Sleep(CAN_TypeDef* CANx)
{ CODESCROLL_FUNC_BEGIN(66, (66, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable187,174) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable188,37,2,0)

  uint8_t sleepstatus = ((uint8_t)0x00);


  ((void)0);


   CANx->MCR = (((CANx->MCR) & (uint32_t)(~((uint32_t)0x00000001))) | ((uint32_t)0x00000002));


  
  CS_CMM_PROBE_NODE_STMT(37,1,1) if ((CANx->MSR & (((uint16_t)0x0002)|((uint16_t)0x0001))) == ((uint16_t)0x0002))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable189,175) 

    
    CS_CMM_PROBE_NODE_STMT(37,0,2) sleepstatus = ((uint8_t)0x01);
  } CS_CMM_ELSE_PROBE_C1(176) 

   
   CS_CMM_PROBE_NODE_STMT(38,7,3) 
    CODESCROLL_FUNC_END(66, 4, 763) return (uint8_t)sleepstatus;
} CODESCROLL_FUNC_END_RBRACE 






uint8_t CAN_WakeUp(CAN_TypeDef* CANx)
{ CODESCROLL_FUNC_BEGIN(67, (67, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable190,177) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable191,38,6,0)

  uint32_t wait_slak = ((uint32_t)0x0000FFFF) ;
  uint8_t wakeupstatus = ((uint8_t)0x00);


  ((void)0);


  CANx->MCR &= ~((uint32_t)0x00000002);


  while( CS_CMM_PROBE_NODE_EXPR(38,5,1) CS_MCDC_67_0(((CANx->MSR & ((uint16_t)0x0002)) == ((uint16_t)0x0002)), (wait_slak!=0x00), 9))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable192,6) 
   
   CS_CMM_PROBE_NODE_STMT(38,4,2) wait_slak--;
  } CS_CMM_PROBE_CX(7) CS_CMM_LABEL(cs_cmm_while_end_67_1) 
  
  CS_CMM_PROBE_NODE_STMT(38,3,3) if((CANx->MSR & ((uint16_t)0x0002)) != ((uint16_t)0x0002))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable193,178) 

    
    CS_CMM_PROBE_NODE_STMT(38,2,4) wakeupstatus = ((uint8_t)0x01);
  } CS_CMM_ELSE_PROBE_C1(179) 

  
  CS_CMM_PROBE_NODE_STMT(38,1,5) 
   CODESCROLL_FUNC_END(67, 4, 793) return (uint8_t)wakeupstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 803 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_can.c"*/
FlagStatus CAN_GetFlagStatus(CAN_TypeDef* CANx, uint32_t CAN_FLAG)
{ CODESCROLL_FUNC_BEGIN(68, (68, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable194,180) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable195,38,0,0)

  FlagStatus bitstatus = RESET;

  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(39,7,1) if ((CANx->ESR & CAN_FLAG) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable196,181) 

    
    CS_CMM_PROBE_NODE_STMT(39,6,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable197,182) 

    
    CS_CMM_PROBE_NODE_STMT(39,5,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(39,4,4) 
   CODESCROLL_FUNC_END(68, 4, 821) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 







void CAN_ClearFlag(CAN_TypeDef* CANx, uint32_t CAN_FLAG)
{ CODESCROLL_FUNC_BEGIN(69, (69, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable198,183) 

  
  CS_CMM_PROBE_NODE_STMT(39,3,0) ((void)0);
  ((void)0);

  CANx->ESR &= ~CAN_FLAG;

CS_CMM_PROBE_NODE_STMT(39,2,1) 
 CODESCROLL_FUNC_END(69, 4, 837) } CODESCROLL_FUNC_END_RBRACE 
/* # 849 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_can.c"*/
ITStatus CAN_GetITStatus(CAN_TypeDef* CANx, uint32_t CAN_IT)
{ CODESCROLL_FUNC_BEGIN(70, (70, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable199,184) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable200,39,1,0)

  ITStatus pendingbitstatus = RESET;

  ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(39,0,1) switch (CAN_IT)
  {
    case ((uint32_t)0x00000005): CS_CMM_PROBE_C1(185) 
      
      CS_CMM_PROBE_NODE_STMT(40,7,2) pendingbitstatus = CheckITStatus(CANx->TSR, ((uint32_t)0x00000001));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    case ((uint32_t)0x00000006): CS_CMM_PROBE_C1(186) 
      
