irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_can_1027_IUT.c
      CS_CMM_PROBE_NODE_STMT(40,6,3) pendingbitstatus = CheckITStatus(CANx->TSR, ((uint32_t)0x00000100));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    case ((uint32_t)0x00000007): CS_CMM_PROBE_C1(187) 
      
      CS_CMM_PROBE_NODE_STMT(40,5,4) pendingbitstatus = CheckITStatus(CANx->TSR, ((uint32_t)0x00010000));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    case ((uint32_t)0x00000004): CS_CMM_PROBE_C1(188) 
      
      CS_CMM_PROBE_NODE_STMT(40,4,5) pendingbitstatus = CheckITStatus(CANx->RF0R, ((uint32_t)0x00000008));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    case ((uint32_t)0x00000008): CS_CMM_PROBE_C1(189) 
      
      CS_CMM_PROBE_NODE_STMT(40,3,6) pendingbitstatus = CheckITStatus(CANx->RF0R, ((uint32_t)0x00000010));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    case ((uint32_t)0x00000020): CS_CMM_PROBE_C1(190) 
      
      CS_CMM_PROBE_NODE_STMT(40,2,7) pendingbitstatus = CheckITStatus(CANx->RF1R, ((uint32_t)0x00000008));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    case ((uint32_t)0x00000040): CS_CMM_PROBE_C1(191) 
      
      CS_CMM_PROBE_NODE_STMT(40,1,8) pendingbitstatus = CheckITStatus(CANx->RF1R, ((uint32_t)0x00000010));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    case ((uint32_t)0x00000100): CS_CMM_PROBE_C1(192) 
      
      CS_CMM_PROBE_NODE_STMT(40,0,9) pendingbitstatus = CheckITStatus(CANx->ESR, ((uint32_t)0x00000001));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    case ((uint32_t)0x00000200): CS_CMM_PROBE_C1(193) 
      
      CS_CMM_PROBE_NODE_STMT(41,7,10) pendingbitstatus = CheckITStatus(CANx->ESR, ((uint32_t)0x00000002));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    case ((uint32_t)0x00000400): CS_CMM_PROBE_C1(194) 
      
      CS_CMM_PROBE_NODE_STMT(41,6,11) pendingbitstatus = CheckITStatus(CANx->ESR, ((uint32_t)0x00000004));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    case ((uint32_t)0x00020000): CS_CMM_PROBE_C1(195) 
      
      CS_CMM_PROBE_NODE_STMT(41,5,12) pendingbitstatus = CheckITStatus(CANx->MSR, ((uint32_t)0x00000010));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    case ((uint32_t)0x00010000): CS_CMM_PROBE_C1(196) 
      
      CS_CMM_PROBE_NODE_STMT(41,4,13) pendingbitstatus = CheckITStatus(CANx->MSR, ((uint32_t)0x00000008));
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
    default : CS_CMM_PROBE_C1(197) 
      
      CS_CMM_PROBE_NODE_STMT(41,3,14) pendingbitstatus = RESET;
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_70_1) ;
  } CS_CMM_LABEL(cs_cmm_switch_end_70_1) 

  
  CS_CMM_PROBE_NODE_STMT(41,2,15) 
   CODESCROLL_FUNC_END(70, 4, 898) return pendingbitstatus;
} CODESCROLL_FUNC_END_RBRACE 







void CAN_ClearITPendingBit(CAN_TypeDef* CANx, uint32_t CAN_IT)
{ CODESCROLL_FUNC_BEGIN(71, (71, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable201,198) 

  
  CS_CMM_PROBE_NODE_STMT(41,1,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(41,0,1) switch (CAN_IT)
  {
    case ((uint32_t)0x00000005): CS_CMM_PROBE_C1(199) 
      
      CS_CMM_PROBE_NODE_STMT(42,7,2) CANx->TSR = ((uint32_t)0x00000001);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    case ((uint32_t)0x00000006): CS_CMM_PROBE_C1(200) 
      
      CS_CMM_PROBE_NODE_STMT(42,6,3) CANx->TSR = ((uint32_t)0x00000100);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    case ((uint32_t)0x00000007): CS_CMM_PROBE_C1(201) 
      
      CS_CMM_PROBE_NODE_STMT(42,5,4) CANx->TSR = ((uint32_t)0x00010000);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    case ((uint32_t)0x00000004): CS_CMM_PROBE_C1(202) 
      
      CS_CMM_PROBE_NODE_STMT(42,4,5) CANx->RF0R = ((uint32_t)0x00000008);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    case ((uint32_t)0x00000008): CS_CMM_PROBE_C1(203) 
      
      CS_CMM_PROBE_NODE_STMT(42,3,6) CANx->RF0R = ((uint32_t)0x00000010);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    case ((uint32_t)0x00000020): CS_CMM_PROBE_C1(204) 
      
      CS_CMM_PROBE_NODE_STMT(42,2,7) CANx->RF1R = ((uint32_t)0x00000008);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    case ((uint32_t)0x00000040): CS_CMM_PROBE_C1(205) 
      
      CS_CMM_PROBE_NODE_STMT(42,1,8) CANx->RF1R = ((uint32_t)0x00000010);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    case ((uint32_t)0x00000100): CS_CMM_PROBE_C1(206) 
      
      CS_CMM_PROBE_NODE_STMT(42,0,9) CANx->ESR &= ~ ((uint32_t)0x00000001);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    case ((uint32_t)0x00000200): CS_CMM_PROBE_C1(207) 
      
      CS_CMM_PROBE_NODE_STMT(43,7,10) CANx->ESR &= ~ ((uint32_t)0x00000002);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    case ((uint32_t)0x00000400): CS_CMM_PROBE_C1(208) 
      
      CS_CMM_PROBE_NODE_STMT(43,6,11) CANx->ESR &= ~ ((uint32_t)0x00000004);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    case ((uint32_t)0x00010000): CS_CMM_PROBE_C1(209) 
      
      CS_CMM_PROBE_NODE_STMT(43,5,12) CANx->MSR = ((uint32_t)0x00000008);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    case ((uint32_t)0x00020000): CS_CMM_PROBE_C1(210) 
      
      CS_CMM_PROBE_NODE_STMT(43,4,13) CANx->MSR = ((uint32_t)0x00000010);
      CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
    default : CS_CMM_PROBE_C1(211) 
      
      CS_CMM_PROBE_NODE_STMT(43,3,14) CS_CMM_break CS_CMM_GOTO_LABEL_SEMICOLON(cs_cmm_switch_end_71_1) ;
  } CS_CMM_LABEL(cs_cmm_switch_end_71_1) 

CS_CMM_PROBE_NODE_STMT(43,2,15) 
 CODESCROLL_FUNC_END(71, 4, 953) } CODESCROLL_FUNC_END_RBRACE 







static ITStatus CheckITStatus(uint32_t CAN_Reg, uint32_t It_Bit)
{ CODESCROLL_FUNC_BEGIN(72, (72, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable202,212) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable203,43,1,0)

  ITStatus pendingbitstatus = RESET;

  
  CS_CMM_PROBE_NODE_STMT(43,0,1) if ((CAN_Reg & It_Bit) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable204,213) 

    
    CS_CMM_PROBE_NODE_STMT(44,7,2) pendingbitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable205,214) 

    
    CS_CMM_PROBE_NODE_STMT(44,6,3) pendingbitstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(44,5,4) 
   CODESCROLL_FUNC_END(72, 4, 975) return pendingbitstatus;
} CODESCROLL_FUNC_END_RBRACE 
